# -*- coding: utf-8 -*-

rule0 = {
    "content": "严格执行交易纪律，赚自己能赚的钱!",
    "explain": "投资是反人性的，交易同样。严格的止损和止盈是使自己立于不败之地的不二之选。"
}


rule1 = {
    "content": "宁可错过，不能做错！",
    "explain": "超短线交易，追求的是短期内确定性很高的2个点左右的收益。"
               "这种机会无论是熊市还是牛市都很多，错过一个机会也没什么好遗憾的。"
               "如果你因为遗憾而情绪失控，做出错误的交易行为，大概率会造成损失。"
               "因此，多花点时间研究市场，不要去做错误的事情！"
}


rule2 = {
    "content": "坚决执行仓位管理策略！",
    "explain": "高点满仓行为是毒瘤，在高点满仓造成的亏损需要花费很长的时间才有可能挽回。"
               "正常情况下，仓位不超过70%，看似好像会少赚一些，但这剩下的30%是掌握主动性的关键依靠。"
               "在大幅度下跌到人人恐慌的时候，可以考虑满仓干，这是唯一一个满仓的理由。"
}


rule3 = {
    "content": "每周超短线交易行为不超过三次！",
    "explain": "一次超短线交易行为包括一个买入和对应的卖出。"
               "虽说超短线交易行为通常是在风险可控的情况下进行的，"
               "但是这类交易要求不间断的时间投入。"
               "过于频繁的超短线交易行为会导致自己对大环境发生误判。"
}


rule4 = {
    "content": "永远跟着趋势（大环境）走！",
    "explain": "逆趋势操作，从来没有好下场；趋势一旦走坏，任何买入策略都会失效。"
               "大趋势是逐渐引爆的，是一个连续的趋势，量变引发质变，当你承受大跌带来的严重后果时，"
               "其实大跌的引信早已开始燃烧，你却视而不见，直到炸弹爆炸毁掉一切。"
               "当貌似有引信点燃时，立刻带着利润回避，不要犹豫，因为："
               "1.如果引信是真的，你避开了大爆炸；"
               "2.如果引信是假的，你以后依然有机会盈利，股市里永远有机会，"
               "不是吗？股市里，保命（保住你的本金）为佳。"
}

rule5 = {
    "content": "把更多的时间花在选股上面，而不是研究交易，更不是盯盘！",
    "explain": "选中一只好股，不管用什么策略去交易，都可以赚点钱；反过来，再牛逼的交易策略，用在一只烂股上，也很难赚钱。"
               "注意：评价一只股的好坏，是一个综合性的事情，千万不要根据财务指标进行片面的判断。"
               "此外，交易策略的研究也是非常有必要的。"
}


rule6 = {
    "content": "不要试图抄底！",
    "explain": "精准抄底这种事情是不存在的，没有谁可以预先知道哪里是底部。"
               "抄底这个行为本身就一个毒瘤，往往是造成亏损的主因，低点后面通常还有低点。"
}


rule7 = {
    "content": "交易时间段，应该多关注股票池中的交易机会；不要进行选股操作，"
               "更不能买入非股票池中股票！",
    "explain": "股票池可能认为是一种保险机制，贸然买入非股票池的股票，不确定性风险很大。"
               "花大量的时间维护一个高度可靠的股票池是非常值得的！"
}

