#-*- coding:utf-8 -*-
#定义->Define a set of futures
CN_All_Futures={'RB':'螺纹钢', 'C':'玉米'  ,# 'L':'乙烯',
               'WS': '强麦'  ,'ER':'籼稻'  ,#'ME' :'甲醇',
               'MA':'郑醇'   ,'JR':'梗稻'  ,'SM':'锰硅',
               'RO':'菜油'   ,'TA':'甲酸'  ,'AG': '白银',
               'RM': '菜粕'  ,'FG':'玻璃'  ,'CF':'棉花',
               'AU':'黄金'   ,'CU':'沪铜'  ,'AL': '沪铝',
               'ZN':'沪锌'   ,'PB':'沪铅' ,'RU': '橡胶',
               'HC':'热卷'   ,'SR':'白糖'  ,'JM':'焦煤',
               'FU':'燃油'   ,'WR':'线材' ,'A': '大豆',
               'M':'豆粕'    ,'Y' :'豆油'  ,'J': '焦炭',
               'L':'塑料'    ,'SF':'硅铁'  ,'PP':'PP',
               'JD':'鸡蛋'   ,'BB':'胶版'  ,'SN':'沪锡',
               'NI':'沪镍'   ,'CS':'淀粉'  ,'I':'铁矿',
               'P':'棕油'    ,'V':'PVC'    ,'RS':'菜籽',
               'WH':'郑麦'   ,'ZC':'郑煤'}