# coding=utf-8

urdu_text = "میں اگلے چند ماہ میں آپ کے ساتھ کام کرنے کے لئے حوصلہ افزائی پچھلے ہفتے بہت "


unicode_text = u" \u0679\u06cc\u0645. \u0645\u062e\u062a\u0635\u0631 \u0646\u0648\u0679\u0633 " \
               u"\u067e\u0631 \u0627\u0633 \u06a9\u06cc \u0628\u0691\u06be\u062a\u06cc " \
               u"\u06c1\u0648\u0626\u06cc \u0648\u0627\u0631\u062f\u0627\u062a\u0648\u06ba " \
               u"\u067e\u0631 \u0627\u062a\u0641\u0627\u0642 \u06a9\u0631\u0646\u06d2 " \
               u"\u06a9\u0627 \u0634\u06a9\u0631 "
