tips = {}

# 通用模块
common_success = {
    '20000': '成功',
    '20001': '添加成功',
    '20002': '修改成功',
    '20003': '保存成功',
    '20004': '发送成功',
    '20005': '获取成功',
    '20006': '删除成功',
}

common_fail = {
    '50000': '失败',
    '50001': '添加失败',
    '50002': '修改失败',
    '50003': '保存失败',
    '50004': '发送失败',
    '50005': '获取失败',
    '50006': '删除失败',
    '50007': '已存在',
    '50008': '验证码错误',
    '50009': '没有权限',
    '50010': '内部错误',
    '50011': '请求缺少参数',
    '50012': '请求参数不合法',
    '50013': 'post内容不合法',
    '50014': '未找到链接',
    '50015': 'access_token不合法',
    '50016': 'refresh_token不合法',
    '50017': '请求认证不合法(主要是check_sum不合法)',
    '50018': '重复发送相同请求',
    '50019': '请求超出最大调用频率',
    '50020': '文件格式不对，请使用CSV格式',
    '50021': 'access_token过期',
}

common = dict(common_success, **common_fail)

user_success = {
    '21001': '登录成功',
    '21002': '注册成功',
}

user_fail = {
    '61000': '请重新登录',
    '61001': '用户未注册',
    '61002': '密码不正确',
    '61003': '用户已存在',
    '61004': '手机号已存在',
    '61005': '用户ID不存在',
    '61006': '该用户处于封号期间',
    '61007': '用户名或密码错误',
    '61008': '手机号格式不正确',
    '61009': '手机号不能为空',
    '61010': '密码不能为空',
    '61011': '工号已存在',
    '61012': '工号格式不正确',
    '61013': '部门负责人不可以更换岗位',
    '61014': '部门负责人不可以删除',
    '61015': 'Email格式不正确',
    '61016': '用户已离职',
    '61017': '名称过长',
    '61018': '存在该职位的员工，删除职位失败',
    '61019': '该部门下存在员工，删除部门失败',
    '61020': '该子公司下存在员工，删除子公司失败',
    '61021': '缺少部门负责人，请联系部门主管',
    '61022': '部门负责人不可以离职',
    '61023': '有等待处理的审批，无法删除',
    '61024': '有等待处理的审批，无法离职',
}

user = dict(user_success, **user_fail)


course_success = {
    '22005': '课程码开课成功',
}

course_fail = {
    '62001': '课程不存在',
    '62002': '课程已下架',
    '62003': '课程禁止收藏',
    '62004': '课程重复收藏',
    '62005': '课程码不存在',
    '62006': '课程码已使用',
    '62007': '已有内容的大纲不允许修改类型',
}

course = dict(course_success, **course_fail)

school_success = {
    '26000': '成功',
}

school_fail = {
    '66001': '代码格式不正确',
    '66002': '代码已存在',
    '66003': '名称已存在',
    '66004': '所在城市存在重复',
    '66005': '书名已存在，请在书名后添加备注',
}

school = dict(school_success, **school_fail)

m = [common, user, course, school]
for row in m:
    tips.update(row)
